//{{job_prefix}}R  JOB (ACCTNO),'ADD TEAM/USERS',CLASS=A,MSGCLASS=X,
//         NOTIFY=&SYSUID,REGION=0M
//*
//*  JOB TO ADD A RACF GROUP AND USERS VIA BATCH TSO
//*
//STEP1    EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD   SYSOUT=*
//SYSTSIN  DD   *

  DELUSER (USER01, USER02, USER03)
  DELGROUP TEAM01

  ADDGROUP TEAM01 SUPGROUP(SYS1) OWNER(IBMUSER)

  ADDUSER USER01 NAME('Development User 01') OWNER(TEAM01) +
  DFLTGRP(SYS1) PASSWORD(NEWPASS)
  ALTUSER USER01 TSO(ACCTNUM(ACCT001) PROC(DB13PROC) +
  SIZE(65536) COMMAND(ISPF))
  ALTUSER USER01 OMVS(AUTOUID HOME('/u/user01') PROGRAM('/bin/sh'))

  ADDUSER USER02 NAME('Development User 02') OWNER(TEAM01) +
  DFLTGRP(SYS1) PASSWORD(NEWPASS)
  ALTUSER USER02 TSO(ACCTNUM(ACCT001) PROC(DB13PROC) +
  SIZE(65536) COMMAND(ISPF))
  ALTUSER USER02 OMVS(AUTOUID HOME('/u/user02') PROGRAM('/bin/sh'))

  ADDUSER USER03 NAME('Development User 03') OWNER(TEAM01) +
  DFLTGRP(SYS1) PASSWORD(NEWPASS)
  ALTUSER USER03 TSO(ACCTNUM(ACCT001) PROC(DB13PROC) +
  SIZE(65536) COMMAND(ISPF))
  ALTUSER USER03 OMVS(AUTOUID HOME('/u/user03') PROGRAM('/bin/sh'))

  CONNECT (USER01, USER02, USER03) GROUP(TEAM01)

  LISTGRP TEAM01
  LISTUSER USER01 TSO
  LISTUSER USER01 OMVS
  LISTUSER USER02 TSO
  LISTUSER USER02 OMVS
  LISTUSER USER03 TSO
  LISTUSER USER03 OMVS 
/*
//