//{{job_prefix}} A JOB ,'DB2 QUERY',CLASS=A,MSGCLASS=X,
//         MSGLEVEL=(1,1),NOTIFY=&SYSUID
//*
//STEP1    EXEC PGM=IKJEFT01,DYNAMNBR=20
//STEPLIB  DD DISP=SHR,DSN=DBD1.SDSNEXIT
//         DD DISP=SHR,DSN=DB2V13.SDSNLOAD
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSTSIN  DD *
 DSN SYSTEM(DBD1)
 RUN PROGRAM(DSNTEP2) PLAN(DSNTEP2) -
     LIB('DBD1.RUNLIB.LOAD')
 END
/*
//SYSIN DD *
  SELECT CREATOR AS METRIC,
         COUNT(*) AS VALUE
  FROM SYSIBM.SYSTABLES
  GROUP BY CREATOR;
/*